In [3]:
import numpy as np

In [4]:
import pandas as pd

In [30]:
from neobase import NeoBase

In [286]:
from datetime import datetime

In [199]:
b = NeoBase()
#https://pypi.org/project/NeoBase/

In [5]:
!cat searches_m.csv | wc -l

20390198

In [6]:
!cat bookings_m.csv | wc -l

10000011

In [406]:
def getCityName(x):
    return b.get(x.strip(),'city_name_list')[0]

In [401]:
bo = pd.read_csv("bookings_m.csv",sep="^",nrows=10)

In [402]:
bo.head()

,act_date,source,pos_ctry,pos_iata,pos_oid,rloc,cre_date,duration,distance,dep_port,...,route,carrier,bkg_class,cab_class,brd_time,off_time,pax,year,month,oid
0,2013-03-05 00:00:00,1A,DE,a68dd7ae953c8acfb187a1af2dcbe123,1a11ae49fcbf545fd2afc1a24d88d2b7,ea65900e72d71f4626378e2ebd298267,2013-02-22 00:00:00,1708,0,ZRH,...,LHRZRH,VI,T,Y,2013-03-07 08:50:00,2013-03-07 11:33:37,-1,2013,3,NULL
1,2013-03-26 00:00:00,1A,US,e612b9eeeee6f17f42d9b0d3b79e75ca,7437560d8f276d6d05eeb806d9e7edee,737295a86982c941f1c2da9a46a14043,2013-03-26 00:00:00,135270,0,SAL,...,SALATLCLT,NV,L,Y,2013-04-12 13:04:00,2013-04-12 22:05:40,1,2013,3,NULL
2,2013-03-26 00:00:00,1A,US,e612b9eeeee6f17f42d9b0d3b79e75ca,7437560d8f276d6d05eeb806d9e7edee,737295a86982c941f1c2da9a46a14043,2013-03-26 00:00:00,135270,0,SAL,...,CLTATLSAL,NV,U,Y,2013-07-15 07:00:00,2013-07-15 11:34:51,1,2013,3,NULL
3,2013-03-26 00:00:00,1A,AU,0f984b3bb6bd06661c95529bbd6193bc,36472c6dbaf7afec9136ac40364e2794,5ecf00fdcbcec761c43dc7285253d0c1,2013-03-26 00:00:00,30885,0,AKL,...,AKLHKGSVO,XK,G,Y,2013-04-24 23:59:00,2013-04-25 16:06:31,1,2013,3,SYDA82546
4,2013-03-26 00:00:00,1A,AU,0f984b3bb6bd06661c95529bbd6193bc,36472c6dbaf7afec9136ac40364e2794,5ecf00fdcbcec761c43dc7285253d0c1,2013-03-26 00:00:00,30885,0,AKL,...,SVOHKGAKL,XK,G,Y,2013-05-14 20:15:00,2013-05-16 10:44:50,1,2013,3,SYDA82546

In [403]:
#Top 10 Arrival Airports
top10 = bo.groupby('arr_port')['pax'].sum().sort_values(ascending=False)
top10.to_frame()

          pax
arr_port
SIN         6
SVO         2
LGA         2
CLT         2
LHR        -1

In [407]:
cities = list(map(getCityName,top10.index));
cities

['Singapore', 'Moscow', 'New York City', 'Charlotte', 'London']

In [253]:
top10.index = cities

In [255]:
#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html
top10_final = top10.to_frame().rename(columns={'pax':'Passengers'})
top10_final

               Passengers
Singapore               6
Moscow                  2
New York City           2
Charlotte               2
London                 -1

In [ ]:
#se.set_index(se["date_minus_time"],inplace=True)

In [414]:
se = pd.read_csv("searches_m.csv",sep="^",nrows=1000)
se.head()

,Date,Time,TxnCode,OfficeID,Country,Origin,Destination,RoundTrip,NbSegments,Seg1Departure,...,Seg6Arrival,Seg6Date,Seg6Carrier,Seg6BookingCode,From,IsPublishedForNeg,IsFromInternet,IsFromVista,TerminalID,InternetOffice
0,2013-01-01,20:25:57,MPT,624d8c3ac0b3a7ca03e3c167e0f48327,DE,TXL,AUH,1,2,TXL,...,NaN,NaN,NaN,NaN,1ASIWS,0,0,0,d41d8cd98f00b204e9800998ecf8427e,FRA
1,2013-01-01,10:15:33,MPT,b0af35b31588dc4ab06d5cf2986e8e02,MD,ATH,MIL,0,1,ATH,...,NaN,NaN,NaN,NaN,1ASIWS,0,0,0,d41d8cd98f00b204e9800998ecf8427e,KIV
2,2013-01-01,18:04:49,MPT,3561a60621de06ab1badc8ca55699ef3,US,ICT,SFO,1,2,ICT,...,NaN,NaN,NaN,NaN,1ASIWS,0,0,0,d41d8cd98f00b204e9800998ecf8427e,NYC
3,2013-01-01,17:42:40,FXP,1864e5e8013d9414150e91d26b6a558b,SE,RNB,ARN,0,1,RNB,...,NaN,NaN,NaN,NaN,1ASI,0,0,0,d41d8cd98f00b204e9800998ecf8427e,STO
4,2013-01-01,17:48:29,MPT,1ec336348f44207d2e0027dc3a68c118,NO,OSL,MAD,1,2,OSL,...,NaN,NaN,NaN,NaN,1ASIWS,0,0,0,d41d8cd98f00b204e9800998ecf8427e,OSL

In [415]:
se["Date"] = pd.to_datetime(se["Date"],format='%Y-%m-%d')

In [416]:
se['Date'].apply(lambda x: datetime(year=x.year, month=x.month, day=1))

0     2013-01-01
1     2013-01-01
2     2013-01-01
3     2013-01-01
4     2013-01-01
         ...
995   2013-01-01
996   2013-01-01
997   2013-01-01
998   2013-01-01
999   2013-01-01
Name: Date, Length: 1000, dtype: datetime64[ns]

In [424]:
#https://stackoverflow.com/questions/19384532/get-statistics-for-each-group-such-as-count-mean-etc-using-pandas-groupby
all_destination_counts = se.groupby(['Destination','Date']).size().reset_index(name='counts')
all_destination_counts

    Destination       Date  counts
0           ABT 2013-01-01       1
1           ABX 2013-01-01       1
2           ACC 2013-01-01       1
3           ACE 2013-01-01       3
4           ADB 2013-01-01       1
..          ...        ...     ...
366         YYC 2013-01-01       2
367         YYG 2013-01-01       1
368         YYZ 2013-01-01       2
369         ZAD 2013-01-01       2
370         ZRH 2013-01-01       6

[371 rows x 3 columns]

In [443]:
destinations_BCN = destination[destination['Destination']=='BCN']
destinations_BCN

   Destination       Date  counts
24         BCN 2013-01-01      26

In [444]:
destinations_MAD = destination[destination['Destination']=='MAD']
destinations_MAD

    Destination       Date  counts
191         MAD 2013-01-01      11

In [445]:
destinations_AGP = destination[destination['Destination']=='AGP']
destinations_AGP

  Destination       Date  counts
6         AGP 2013-01-01       7

In [441]:
#list(map(getCityName,destinations_BCN['Destination']))

In [442]:
#b.get('AGP', 'city_name_list')